Revit 2024 API
LightShape.Clone Method
 Creates a copy of the LightShape derived object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LightShape Clone()
Visual Basic
Public Function Clone As LightShape
Visual C++
public:
LightShape^ Clone()
See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace